<?php

use yii\db\Migration;

/**
 * Handles the creation of table `{{%troubleshooting_period}}`.
 */
class m190511_100201_create_troubleshooting_period_table extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->createTable('{{%troubleshooting_period}}', [
            'id' => $this->primaryKey(),
            'trouble' => $this->text()->comment('Неисправность'),
            'period' => $this->float()->comment('Предельный срок выполнения ремонта. В часах'),
            'description' => $this->text(),
            'group' => $this->string()
        ]);

        $this->batchInsert('{{%troubleshooting_period}}', ['trouble', 'period', 'description', 'group'], [
            [
                'Протечки в отдельных местах кровли',
                24,
                '',
                'Кровля',
            ],
            [
                'Повреждения системы организованного водоотвода',
                120,
                'водосточных труб, воронок, колен, отметов и пр., расстройство их креплений',
                'Кровля'
            ],
            [
                'Утрата связи отдельных кирпичей с кладкой наружных стен, угрожающая их выпадением',
                24,
                'с немедленным ограждением опасной зоны',
                'Стены',
            ],
            [
                'Не плотность в дымоходах и газоходах и сопряжения их с печами',
                24,
                '',
                'Стены',
            ],
            [
                'Разбитые стекла и сорванные створки оконных переплетов, форточек, балконных дверных полотен в зимнее время',
                24,
                '',
                'Оконные и дверные заполнения',
            ],
            [
                'Разбитые стекла и сорванные створки оконных переплетов, форточек, балконных дверных полотен в летнее время',
                72,
                '',
                'Оконные и дверные заполнения',
            ],
            [
                'Дверные заполнения',
                24,
                'входные двери в подъездах',
                'Оконные и дверные заполнения',
            ],
            [
                'Отслоение штукатурки потолка или верхней части стены, угрожающее ее обрушению',
                120,
                'с немедленным принятием мер безопасности',
                'Внутренняя и наружная отделка',
            ],
            [
                'Нарушение связи наружной облицовки, а также лепных изделий, установленных на фасадах со стенами',
                0,
                'Немедленное принятие мер безопасности',
                'Внутренняя и наружная отделка',
            ],
            [
                'Протечки в перекрытиях, вызванные нарушением водонепроницаемости гидроизоляции полов в санузлах',
                72,
                '',
                'Полы',
            ],
            [
                'Трещины и неисправности в печах, дымоходах и газоходах, могущие вызвать отравление жильцов дымовыми газами и угрожающие пожарной безопасности здания',
                24,
                'с незамедлительным прекращением эксплуатации до исправления',
                'Печи',
            ],
            [
                'Течи в водопроводных кранах и в кранах сливных бачков при унитазах',
                24,
                '',
                'Санитарно-техническое оборудование',
            ],
            [
                'Неисправности аварийного порядка трубопроводов и их сопряжений',
                0,
                'с фитингами, арматурой и приборами водопровода, канализации, горячего водоснабжения, центрального отопления, газооборудования',
                'Санитарно-техническое оборудование',
            ],
            [
                'Неисправности мусоропроводов',
                24,
                '',
                'Санитарно-техническое оборудование',
            ],
            [
                'Повреждение одного из кабелей, питающих жилой дом. Отключение системы питания жилых домов или силового электрооборудования',
                2,
                'При наличии переключателей кабелей на воде в дом - в течение времени, необходимого для прибытия персонала, обслуживающего дом, но не более указанного срока',
                'Электрооборудование',
            ],
            [
                'Неисправности во вводно-распределительном устройстве, связанные с заменой предохранителей, автоматических выключателей, рубильников',
                3,
                '',
                'Электрооборудование',
            ],
            [
                'Неисправности автоматов защиты стояков и питающих линий',
                3,
                '',
                'Электрооборудование',
            ],
            [
                'Неисправности аварийного порядка',
                0,
                'короткое замыкание в элементах внутридомовой электрической сети и т.п',
                'Электрооборудование',
            ],
            [
                'Неисправности в электроплите, с выходом из строя одной конфорки и жарочного шкафа',
                72,
                '',
                'Электрооборудование',
            ],
            [
                'Неисправности в электроплите, с отключением всей электроплиты',
                3,
                '',
                'Электрооборудование',
            ],
            [
                'Неисправности в системе освещения общедомовых помещений',
                168,
                'с заменой ламп накаливания, люминесцентных ламп, выключателей и конструктивных элементов светильников',
                'Электрооборудование',
            ],
            [
                'Неисправности лифта',
                24,
                '',
                'Лифт',
            ],
            [
                'Звонок в УК',
                0.083,
                '',
                'Разное',
            ],
            [
                'Обработка заявки и обратный ответ заявителю',
                0.5,
                '',
                'Разное',
            ],
            [
                'Локализация аварии на инженерных сетях ГВС, ХВС, водоответвления, отопления и электроснабжения',
                0.5,
                '',
                'Разное',
            ],
            [
                'Аварийное повреждение',
                72,
                '',
                'Разное',
            ],
            [
                'Ликвидация аварии на инженерных сетях водоответвления',
                2,
                '',
                'Санитарно-техническое оборудование',
            ],
            [
                'Ликвидация засора в мусоропроводе',
                2,
                'в интервале с 8:00 до 23:00',
                'Санитарно-техническое оборудование',
            ],
        ]);
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        $this->dropTable('{{%troubleshooting_period}}');
    }
}
